[
    {
        "pair_id": 0,
        "options": [
            "Chicken", "Egg"
        ],
        "correct_option": "Egg",
        "description": "The age-old question: Which came first, the chicken or the egg? While chickens are descendants of birds that were not quite chickens, genetic mutations occurred in their offspring, leading to the first bird that we would call a chicken. Therefore, the first true chicken must have hatched from an egg laid by a bird that was very close to a chicken but not quite there."
    },
    {
        "pair_id": 1,
        "options": [
            "Pyramids", "Sphinx"
        ],
        "correct_option": "Sphinx",
        "description": "The Great Sphinx was carved around 2500 BCE, while the earliest pyramids in Egypt were constructed a few decades later as elaborate tombs for pharaohs."
    },
    {
        "pair_id": 2,
        "options": [
            "Fire", "Wheel"
        ],
        "correct_option": "Fire",
        "description": "Fire was harnessed by early humans around 1 million years ago, while the wheel was invented around 3500 BCE, revolutionizing transportation and machinery."
    },
    {
        "pair_id": 3,
        "options": [
            "Writing", "Farming"
        ],
        "correct_option": "Farming",
        "description": "Farming emerged around 10,000 BCE with the rise of agriculture, enabling settled societies. Writing systems, like cuneiform, began around 3000 BCE, marking the dawn of recorded history."
    }, {
        "pair_id": 4,
        "options": [
            "Stonehenge", "Colosseum"
        ],
        "correct_option": "Stonehenge",
        "description": "Stonehenge's construction began around 3000 BCE as a prehistoric monument, whereas the Colosseum was built in 70-80 CE, hosting gladiatorial contests and spectacles."
    }, {
        "pair_id": 5,
        "options": [
            "Tea", "Coffee"
        ],
        "correct_option": "Tea",
        "description": "Tea consumption dates back to ancient China in the 3rd millennium BCE, while coffee cultivation began in the Arab world around the 15th century CE."
    }, {
        "pair_id": 6,
        "options": [
            "Gunpowder", "Printing Press"
        ],
        "correct_option": "Gunpowder",
        "description": "Gunpowder was invented in 9th-century China, revolutionizing warfare. The printing press, developed by Johannes Gutenberg in the 15th century, transformed communication and education."
    }, {
        "pair_id": 7,
        "options": [
            "Mona Lisa", "Starry Night"
        ],
        "correct_option": "Mona Lisa",
        "description": "The Mona Lisa was painted by Leonardo da Vinci in the early 16th century, while Vincent van Gogh's Starry Night was created in 1889."
    }, {
        "pair_id": 8,
        "options": [
            "Steam Engine", "Electricity"
        ],
        "correct_option": "Steam Engine",
        "description": "The steam engine, crucial to the Industrial Revolution, was developed in the 18th century. Electricity, harnessed for practical use, emerged in the late 19th century."
    }, {
        "pair_id": 9,
        "options": [
            "Radio", "Television"
        ],
        "correct_option": "Radio",
        "description": "The radio was developed in the late 19th century, enabling long-distance communication. Television, with moving images, became widespread in the mid-20th century."
    }, {
        "pair_id": 10,
        "options": [
            "Penicillin", "Polio Vaccine"
        ],
        "correct_option": "Penicillin",
        "description": "Alexander Fleming discovered penicillin's antibacterial properties in 1928, leading to the development of antibiotics. The polio vaccine, created by Jonas Salk in 1955, marked a major breakthrough in public health."
    }, {
        "pair_id": 11,
        "options": [
            "First Airplane", "Moon Landing"
        ],
        "correct_option": "First Airplane",
        "description": "The Wright brothers' first successful airplane flight was in 1903, while the Apollo 11 mission achieved the moon landing in 1969."
    }, {
        "pair_id": 12,
        "options": [
            "Internet", "Smartphone"
        ],
        "correct_option": "Internet",
        "description": "The precursor to the internet, ARPANET, was established in the late 1960s. The first smartphone, IBM Simon, was introduced in 1992."
    }, {
        "pair_id": 13,
        "options": [
            "Facebook", "YouTube"
        ],
        "correct_option": "Facebook",
        "description": "YouTube, a platform for sharing videos, was created in 2005. Facebook, a social networking site, started in 2004, connecting people globally."
    }, {
        "pair_id": 14,
        "options": [
            "Google", "Amazon"
        ],
        "correct_option": "Amazon",
        "description": "Google's search engine debuted in 1997, revolutionizing online information retrieval. Amazon, initially an online bookstore in 1994, evolved into a vast e-commerce and tech giant."
    }, {
        "pair_id": 15,
        "options": [
            "Netflix", "Google"
        ],
        "correct_option": "Netflix",
        "description": "Netflix, founded by Marc Randolph and Reed Hastings on August 29, 1997, started as a DVD rental-by-mail service before transitioning to online streaming. Google, officially launched in 1998 by Larry Page and Sergey Brin, revolutionized web search and digital services. While both companies emerged around the same time, Netflix predates Google and pioneered the concept of online streaming, reshaping the way we consume media."
    }, {
        "pair_id": 16,
        "options": [
            "Eiffel Tower", "Statue of Liberty"
        ],
        "correct_option": "Statue of Liberty",
        "description": "The Statue of Liberty was dedicated in 1886 as a symbol of freedom and democracy, whereas the Eiffel Tower was completed in 1889 as a prominent Parisian landmark."
    }, {
        "pair_id": 17,
        "options": [
            "Microscope", "Telescope"
        ],
        "correct_option": "Microscope",
        "description": "The microscope, used to observe tiny objects, was developed in the late 16th century. Telescopes, designed for celestial observations, became popular in the early 17th century."
    }, {
        "pair_id": 18,
        "options": [
            "Dinosaurs", "First Flowers"
        ],
        "correct_option": "Dinosaurs",
        "description": "Dinosaurs, which dominated the Earth during the Mesozoic Era, existed from approximately 230 to 65 million years ago. In contrast, the emergence of the first flowers, marking the rise of angiosperms, occurred around 140 million years ago, adding vibrant colors and new ecological dynamics to terrestrial ecosystems."
    }, {
        "pair_id": 19,
        "options": [
            "Hubble Space Telescope", "The First iPhone"
        ],
        "correct_option": "Hubble Space Telescope",
        "description": "The Hubble Space Telescope, launched in 1990, provided stunning images of distant galaxies. The iPhone, a revolutionary smartphone, was introduced by Apple in 2007."
    }, {
        "pair_id": 20,
        "options": [
            "World War I", "Theory of Relativity"
        ],
        "correct_option": "Theory of Relativity",
        "description": "Albert Einstein's Theory of Relativity, a groundbreaking concept in physics, was published in the year 1905 (for the first time) and revolutionized our understanding of space, time, and gravity. World War I, a global conflict lasting from 1914 to 1918, reshaped geopolitical landscapes and marked a significant chapter in modern history."
    }, {
        "pair_id": 21,
        "options": [
            "Mouse", "Keyboard"
        ],
        "correct_option": "Keyboard",
        "description": "The keyboard, invented by Christopher Latham Sholes in 1878, is a device used for inputting text and commands into computers, evolving from early typewriters to modern computer keyboards. The mouse, invented by Douglas Engelbart in 1968, is a pointing device that revolutionized computer interaction, enhancing graphical user interfaces and navigation."
    }, {
        "pair_id": 22,
        "options": [
            "Facebook", "Instagram"
        ],
        "correct_option": "Facebook",
        "description": "Facebook, a social networking site, started in 2004, connecting people globally. Instagram, a photo-sharing platform, was launched in 2010 and later acquired by Facebook."
    }, {
        "pair_id": 23,
        "options": [
            "Artificial Intelligence", "Blockchain"
        ],
        "correct_option": "Artificial Intelligence",
        "description": "The concept of Artificial Intelligence (AI) emerged in the mid-20th century, focusing on computer systems simulating human intelligence. Blockchain technology, underlying cryptocurrencies, gained prominence in the late 2000s."
    }, {
        "pair_id": 24,
        "options": [
            "Vinyl Records", "Compact Discs"
        ],
        "correct_option": "Vinyl Records",
        "description": "Vinyl records, analog audio discs, were introduced in the late 19th century and experienced their peak in the mid-20th century. Compact Discs (CDs), digital optical discs, were introduced in the 1980s."
    }, {
        "pair_id": 25,
        "options": [
            "Google Chrome", "Mozilla Firefox"
        ],
        "correct_option": "Mozilla Firefox",
        "description": "Mozilla Firefox, a web browser developed by Mozilla Foundation, was first released in 2002 as an open-source alternative to Internet Explorer. Google Chrome, developed by Google, made its debut in 2008, quickly gaining popularity for its speed and simplicity."
    }, {
        "pair_id": 26,
        "options": [
            "Cave Paintings", "Hieroglyphs"
        ],
        "correct_option": "Cave Paintings",
        "description": "Cave paintings, found in various parts of the world, date back tens of thousands of years, capturing early human artistry. Hieroglyphs, a form of ancient Egyptian writing, began around 3300 BCE."
    }, {
        "pair_id": 27,
        "options": [
            "Wheelbarrow", "Windmill"
        ],
        "correct_option": "Windmill",
        "description": "The wheelbarrow, an early construction tool, dates back to ancient Greece and China. Windmills, harnessed for grinding grain and pumping water, were developed around 7th-century Persia."
    }, {
        "pair_id": 28,
        "options": [
            "Dinosaurs", "Ancient Sharks"
        ],
        "correct_option": "Ancient Sharks",
        "description": "Ancient sharks, part of the Chondrichthyes class, have existed for hundreds of millions of years, predating even the dinosaurs. Their lineage dates back to the early Devonian period, around 420 million years ago. Dinosaurs, on the other hand, roamed the Earth during the Mesozoic Era, spanning from approximately 252 to 66 million years ago."
    }, {
        "pair_id": 29,
        "options": [
            "Sundial", "Compass"
        ],
        "correct_option": "Compass",
        "description": "Sundials, relying on the sun's position, were used by ancient civilizations. The compass, invented in ancient China, became a navigational aid by the 11th century."
    }, {
        "pair_id": 30,
        "options": [
            "Plato", "Aristotle"
        ],
        "correct_option": "Aristotle",
        "description": "Plato, a philosopher, lived around 428-348 BCE, founding the Academy in Athens. Aristotle, Plato's student, taught at the Academy and later founded his own school, the Lyceum.",
        "is_person": true
    }, {
        "pair_id": 31,
        "options": [
            "Rice Cultivation", "Wheat Cultivation"
        ],
        "correct_option": "Wheat Cultivation",
        "description": "Wheat cultivation dates back to ancient civilizations, with evidence of its cultivation in the Fertile Crescent around 9600 BCE. It played a crucial role in the development of agriculture and settled societies. In contrast, rice cultivation began in Asia around 7000 BCE, contributing to the growth of complex civilizations in regions like the Indus Valley and China."
    }, {
        "pair_id": 32,
        "options": [
            "Wright Brothers", "Amelia Earhart"
        ],
        "correct_option": "Wright Brothers",
        "description": "The Wright brothers, pioneers of aviation, made their first successful flight in 1903. Amelia Earhart, a pioneering aviator, became the first woman to fly solo across the Atlantic in 1932.",
        "is_person": true
    }, {
        "pair_id": 33,
        "options": [
            "Penicillin", "X-rays"
        ],
        "correct_option": "X-rays",
        "description": "X-rays, a groundbreaking medical imaging technology, were discovered by Wilhelm Conrad Roentgen in 1895. Penicillin, the first widely used antibiotic, was discovered by Alexander Fleming in 1928."
    }, {
        "pair_id": 34,
        "options": [
            "Atomic Theory", "Theory of Relativity"
        ],
        "correct_option": "Atomic Theory",
        "description": "Atomic theory, first proposed by ancient Greek philosophers around 5th century BCE, gained modern understanding in the 19th and 20th centuries through advancements in chemistry and quantum mechanics. Meanwhile, Albert Einstein's theory of relativity, formulated in the early 20th century, revolutionized our understanding of space, time, and gravity."
    }, {
        "pair_id": 35,
        "options": [
            "Vinyl Records", "Cassette Tapes"
        ],
        "correct_option": "Cassette Tapes",
        "description": "Vinyl records, a popular audio format, gained traction in the mid-20th century. Cassette tapes, compact and portable, rose to prominence in the 1970s."
    }, {
        "pair_id": 36,
        "options": [
            "Black and White TV", "Color TV"
        ],
        "correct_option": "Black and White TV",
        "description": "Black and white televisions were commercially available in the 1930s. Color television technology was developed in the 1950s, leading to its widespread adoption."
    }, {
        "pair_id": 37,
        "options": [
            "Fax Machine", "Email"
        ],
        "correct_option": "Fax Machine",
        "description": "The fax machine, used for transmitting documents over phone lines, gained popularity in the mid-20th century. Email, a revolutionary form of electronic communication, emerged in the late 20th century."
    }, {
        "pair_id": 38,
        "options": [
            "First Olympics", "First Paralympics"
        ],
        "correct_option": "First Olympics",
        "description": "The ancient Olympic Games began in ancient Greece around 776 BCE. The Paralympic Games, for athletes with disabilities, were first held in 1960."
    }, {
        "pair_id": 39,
        "options": [
            "Leonardo da Vinci", "Michelangelo"
        ],
        "correct_option": "Leonardo da Vinci",
        "description": "Leonardo da Vinci, a Renaissance polymath, lived from 1452 to 1519, known for his diverse talents. Michelangelo, a renowned artist, and sculptor, lived from 1475 to 1564, leaving a lasting mark on art.",
        "is_person": true
    }, {
        "pair_id": 40,
        "options": [
            "Compass", "Sundial"
        ],
        "correct_option": "Sundial",
        "description": "The compass, invented in ancient China, became a navigational aid by the 11th century. Sundials, relying on the sun's position, were used by ancient civilizations."
    }, {
        "pair_id": 41,
        "options": [
            "Apple", "Microsoft"
        ],
        "correct_option": "Microsoft",
        "description": "Apple, founded by Steve Jobs, Steve Wozniak, and Ronald Wayne on April 1, 1976, introduced the Apple I computer. Microsoft, founded by Bill Gates and Paul Allen on April 4, 1975, started by developing software for the Altair 8800. Both companies played pivotal roles in the personal computing revolution, but Microsoft predates Apple and contributed to shaping modern consumer technology with its innovative products."
    }, {
        "pair_id": 42,
        "options": [
            "First E-mail", "First Website"
        ],
        "correct_option": "First E-mail",
        "description": "The first e-mail was sent by Ray Tomlinson in 1971, marking a significant milestone in the history of electronic communication. The first website, created by Tim Berners-Lee, went live in 1991, introducing the concept of the World Wide Web. While both the first e-mail and the first website contributed to shaping the modern digital landscape, the first e-mail predates the establishment of the World Wide Web."
    }, {
        "pair_id": 43,
        "options": [
            "Igneous Rocks", "Sedimentary Rocks"
        ],
        "correct_option": "Igneous Rocks",
        "description": "Igneous rocks form from the cooling and solidification of molten materials such as magma or lava. They are the oldest type of rocks on Earth, dating back billions of years. Sedimentary rocks, on the other hand, are formed by the accumulation and compression of sediment over time. While both types of rocks contribute to the Earth's geological history, igneous rocks predate sedimentary rocks in terms of their formation and origin."
    }, {
        "pair_id": 44,
        "options": [
            "Linkin Park", "Green Day"
        ],
        "correct_option": "Green Day",
        "description": "Green Day, formed in 1986 by Billie Joe Armstrong, Mike Dirnt, and Tre Cool, is a renowned punk rock band known for hits like 'Basket Case' and 'American Idiot.' Linkin Park, formed in 1996, gained fame with their fusion of rock and electronic elements in songs like 'In the End' and 'Numb.' While both bands have had significant impacts on the rock music scene, Green Day predates Linkin Park and is considered one of the pioneers of modern punk rock."
    }, {
        "pair_id": 45,
        "options": [
            "Pizza", "Hamburger"
        ],
        "correct_option": "Pizza",
        "description": "Pizza, with origins dating back to ancient civilizations like the Greeks, Egyptians, and Romans, has evolved into the modern version we know today, originating in Naples, Italy in the 18th century. The hamburger, a ground meat patty sandwich, is believed to have been created in the United States in the late 1800s, with debates about its exact origin in places like New Haven, Connecticut, or Texas."
    }, {
        "pair_id": 46,
        "options": [
            "Bob Dylan", "Michael Jackson"
        ],
        "correct_option": "Bob Dylan",
        "description": "Bob Dylan, born on May 24, 1941, is an influential singer-songwriter who emerged in the folk music scene during the 1960s. Michael Jackson, known as the King of Pop, was born on August 29, 1958, and gained international fame with hits like 'Thriller' and 'Billie Jean.' While both artists are iconic, Bob Dylan predates Michael Jackson and is recognized for his contributions to folk and protest music.",
        "is_person": true
    }, {
        "pair_id": 47,
        "options": [
            "Elvis Presley", "Madonna"
        ],
        "correct_option": "Elvis Presley",
        "description": "Elvis Presley, born on January 8, 1935, was the King of Rock and Roll, becoming a cultural icon with his rockabilly sound in the 1950s. Madonna, born on August 16, 1958, and known as the Queen of Pop, rose to prominence in the 1980s with hits like 'Like a Virgin' and 'Material Girl.' While both artists have left their marks on popular music, Elvis Presley predates Madonna and played a pivotal role in shaping rock and roll.",
        "is_person": true
    }, {
        "pair_id": 48,
        "options": [
            "Johann Sebastian Bach", "Ludwig van Beethoven"
        ],
        "correct_option": "Johann Sebastian Bach",
        "description": "Johann Sebastian Bach, born on March 31, 1685, was a prolific composer of the Baroque period, renowned for his intricate compositions. Ludwig van Beethoven, born on December 17, 1770, was a composer from the Classical to Romantic transition, creating groundbreaking symphonies like the 'Ninth Symphony.' While both composers are giants in classical music, Johann Sebastian Bach predates Beethoven and left a lasting legacy on music composition.",
        "is_person": true
    }, {
        "pair_id": 49,
        "options": [
            "Frank Sinatra", "Elton John"
        ],
        "correct_option": "Frank Sinatra",
        "description": "Frank Sinatra, born on December 12, 1915, known as the Chairman of the Board, was a legendary crooner and actor with hits like 'My Way' and 'New York, New York.' Elton John, born on March 25, 1947, a singer-songwriter and pianist, captivated audiences with his distinctive style and songs like 'Rocket Man' and 'Candle in the Wind.' While both artists are celebrated, Frank Sinatra predates Elton John and is a symbol of classic vocal performance.",
        "is_person": true
    }, {
        "pair_id": 50,
        "options": [
            "Ed Sheeran", "Taylor Swift"
        ],
        "correct_option": "Taylor Swift",
        "description": "Taylor Swift, born on December 13, 1989, is a renowned singer-songwriter who gained prominence in the mid-2000s and has become one of the most successful artists of her generation. Ed Sheeran, born on February 17, 1991, is also a singer-songwriter who rose to fame in the late 2000s and has achieved global recognition for his heartfelt music and performances.",
        "is_person": true
    }, {
        "pair_id": 51,
        "options": [
            "Piano", "Violin"
        ],
        "correct_option": "Violin",
        "description": "The violin, with origins dating back to the early 16th century, produces melodic and expressive sounds. The piano, invented in the early 18th century, gained popularity as a versatile keyboard instrument."
    }, {
        "pair_id": 52,
        "options": [
            "Violin", "Mandolin"
        ],
        "correct_option": "Violin",
        "description": "The mandolin, developed in the 18th century and popularized in various musical styles, has a distinct twangy sound. The violin, with its classical heritage dating back centuries even before the Mandolin, is known for its rich and resonant tones."
    }, {
        "pair_id": 53,
        "options": [
            "Flute", "Saxophone"
        ],
        "correct_option": "Flute",
        "description": "The saxophone, invented by Adolphe Sax in the mid-19th century, is a versatile woodwind instrument with a powerful and expressive sound. The flute, the oldest of which are dating to about 53,000 to 45,000 years old, produces sweet and airy tones."
    }, {
        "pair_id": 54,
        "options": [
            "Guitar", "Drums"
        ],
        "correct_option": "Guitar",
        "description": "The guitar, with origins dating back to ancient civilizations, has evolved into a versatile string instrument producing melodic and rhythmic sounds. Drums, essential percussive instruments, have been used for millennia to provide rhythmic foundations."
    }, {
        "pair_id": 55,
        "options": [
            "Ukulele", "Guitar"
        ],
        "correct_option": "Guitar",
        "description": "The guitar, with ancient roots and diverse styles, produces melodic and rhythmic sounds. The ukulele, developed in the 19th century in Hawaii, is known for its bright and cheerful tones."
    }, {
        "pair_id": 56,
        "options": [
            "London", "New York"
        ],
        "correct_option": "London",
        "description": "London, founded by the Romans around 43 AD, has a rich history as the capital of the United Kingdom. New York, originally settled by the Dutch in the early 17th century, later became a major global city."
    }, {
        "pair_id": 57,
        "options": [
            "Kolkata", "Delhi"
        ],
        "correct_option": "Delhi",
        "description": "Delhi, with a history dating back to ancient times, has served as a capital for various empires. Kolkata, founded by the British in the 17th century, was an important center of trade and culture during the colonial era."
    }, {
        "pair_id": 58,
        "options": [
            "Cotton", "Silk"
        ],
        "correct_option": "Cotton",
        "description": "Reports of the spinning of cotton in India date back to 3000 BCE, showcasing its early use in textiles. The highly developed Chinese culture originated the manufacture of silk and silk products, with the invention and development of sericulture (cultivation of silkworms for raw-silk production) and methods to spin silk dating from 2640 BCE."
    }, {
        "pair_id": 59,
        "options": [
            "Indus Valley Civilisation", "Roman Empire"
        ],
        "correct_option": "Indus Valley Civilisation",
        "description": "The Indus Valley Civilisation, a remarkable Bronze Age culture that thrived from 3300 BCE to 1300 BCE, flourished in what is now modern-day Pakistan and India. The Roman Empire, founded in 31 BCE, encompassed vast territories across Europe, North Africa, and the Middle East.They both had their own contributions to the world, but in terms of time, The Indus Valley Civilisation fluorished before the Roman Empire."
    }, {
        "pair_id": 60,
        "options": [
            "Telegraph", "Telephone"
        ],
        "correct_option": "Telegraph",
        "description": "The telegraph, developed in the early 19th century, revolutionized long-distance communication by transmitting coded electrical signals over wires. It enabled near-instantaneous communication across great distances. The telephone, invented by Alexander Graham Bell in 1876, further advanced communication by allowing voice transmission through electrical signals, transforming personal and business interactions."
    }, {
        "pair_id": 61,
        "options": [
            "Fiction Books", "Non-Fiction Books"
        ],
        "correct_option": "Fiction Books",
        "description": "Fictional literature, including novels, short stories, and myths, has been part of storytelling traditions for centuries. Non-fiction, encompassing factual accounts and essays, emerged as a distinct genre much later."
    }, {
        "pair_id": 62,
        "options": [
            "Rome", "Athens"
        ],
        "correct_option": "Athens",
        "description": "Athens, the ancient Greek city-state, is often regarded as the birthplace of democracy and the center of ancient Greek civilization. It was founded around 3000 BCE. Rome, on the other hand, originated as a small settlement in the 8th century BCE and later became a powerful empire that absorbed Greek influences."
    }, {
        "pair_id": 63,
        "options": [
            "Jazz", "Rock"
        ],
        "correct_option": "Jazz",
        "description": "Jazz, a genre originating in the African-American communities of New Orleans, Louisiana, in the late 19th and early 20th centuries, evolved from mixed cultures, with roots in blues and ragtime. Rock music, on the other hand, developed from blues, country, and jazz influences in the 1950s."
    }, {
        "pair_id": 64,
        "options": [
            "Toothbrush", "Toothpaste"
        ],
        "correct_option": "Toothbrush",
        "description": "Toothbrushing tools date back to 3500-3000 BC when the Babylonians and the Egyptians made a brush by fraying the end of a twig. Around 1600 BC, the Chinese developed 'chewing sticks.' Toothpaste, used for oral hygiene, has ancient origins, with early use by Egyptians around 5000 BC, even before toothbrushes were invented"
    }, {
        "pair_id": 65,
        "options": [
            "Skirts", "Pants"
        ],
        "correct_option": "Skirts",
        "description": "Skirts, garments worn around the waist, have been part of human clothing for centuries, dating back to ancient civilizations. They have varied in length, style, and material across different cultures and time periods. On the other hand, pants, a more recent addition to clothing, became more common in the late Middle Ages and Renaissance as societies evolved and activities required greater mobility. Pants offer increased practicality and are often associated with modern fashion trends."
    }, {
        "pair_id": 66,
        "options": [
            "Steam Engine", "Automobile"
        ],
        "correct_option": "Steam Engine",
        "description": "The steam engine, a revolutionary invention, was developed in the 18th century. It played a crucial role in the Industrial Revolution by powering machinery and transportation. Automobiles, powered by internal combustion engines, came much later. On January 29, 1886, Carl Benz applied for a patent for his “vehicle powered by a gas engine.” The patent number: 37435 may be regarded as the birth certificate of the automobile."
    }, {
        "pair_id": 67,
        "options": [
            "Mirrors", "Combs"
        ],
        "correct_option": "Mirrors",
        "description": "Mirrors have a long history dating back approximately 8000 years. The earliest known manufactured mirrors were made from obsidian with a convex surface and remarkably good optical quality. These mirrors have been found in Anatolia (south central modern-day Turkey). On the other hand, combs have been used since prehistoric times, with refined forms discovered in settlements dating back 5,000 years in Persia."
    }, {
        "pair_id": 68,
        "options": [
            "Refrigerator", "Microwave Oven"
        ],
        "correct_option": "Refrigerator",
        "description": "The first practical refrigeration machine was built in the early 1800s. The concept of microwave heating using magnetrons was developed during World War II, and the first microwave oven for domestic use was introduced in the 1950s."
    }, {
        "pair_id": 69,
        "options": [
            "Umbrella", "Raincoat"
        ],
        "correct_option": "Umbrella",
        "description": "Umbrellas as protective devices date back thousands of years to ancient civilizations. The raincoat designed much later, designed for wet weather, gained popularity in the 19th century as waterproof materials were developed."
    }, {
        "pair_id": 70,
        "options": [
            "Wrist Watch", "Calculators"
        ],
        "correct_option": "Wrist Watch",
        "description": "The wrist watch, a portable timekeeping device worn on the wrist, became popular in the late 19th and early 20th centuries. It evolved from pocket watches and quickly became a fashionable accessory. On the other hand, calculators, devices used for mathematical calculations, were developed in various forms over the years. The mechanical calculators of the 19th century paved the way for electronic and digital calculators, which gained prominence in the mid-20th century as technology advanced."
    }, {
        "pair_id": 71,
        "options": [
            "Pencil", "Eraser"
        ],
        "correct_option": "Pencil",
        "description": "The modern pencil with a graphite core encased in wood was developed in the 16th century. Erasers, used to remove pencil marks, were introduced in the 18th century as rubber became available."
    }, {
        "pair_id": 72,
        "options": [
            "Laptop", "Smartphone"
        ],
        "correct_option": "Smartphone",
        "description": "Laptops, portable computers, became popular in the late 20th century with advancements in technology. Smartphones, combining mobile communication and computing, emerged in the early 21st century."
    }, {
        "pair_id": 73,
        "options": [
            "Bed", "Pillow"
        ],
        "correct_option": "Bed",
        "description": "Beds, used since ancient times, have evolved from simple structures to comfortable sleep surfaces. The oldest known 'bed' dates back 77,000 years, discovered in South Africa, consisting of layers of plant material. Pillows originated in ancient Mesopotamia around 7,000 B.C., providing comfort during sleep."
    }, {
        "pair_id": 74,
        "options": [
            "Socks", "Shoes"
        ],
        "correct_option": "Shoes",
        "description": "Socks, worn on the feet for warmth and comfort, have a history dating back to ancient times. The earliest known pair of socks, created by Nålebinding (Danish: literally 'binding with a needle' or 'needle-binding'), dates from 300 to 500 CE. On the other hand, shoes, protective footwear, have an even longer history, with the oldest known leather shoe, the Areni-1 shoe, dating back around 5,500 years."
    }, {
        "pair_id": 75,
        "options": [
            "Fork", "Knife"
        ],
        "correct_option": "Knife",
        "description": "Knives have been essential tools for cutting and chopping throughout history. In fact, the first knives date back as far as 2 and a half million years ago and were crafted by early ancestors of modern humans. Forks, used for eating, became more common in Europe during the Middle Ages as dining customs evolved."
    }, {
        "pair_id": 76,
        "options": [
            "Shah Rukh Khan", "Salman Khan"
        ],
        "correct_option": "Shah Rukh Khan",
        "description": "Salman Khan, born on December 27, 1965, is a prominent Bollywood actor known for his versatile roles in Indian cinema. Shah Rukh Khan, born on November 2, 1965, is another iconic Bollywood actor, often referred to as the 'King of Bollywood,' with numerous successful films to his credit. Their birthdays are just a month apart, but Shahrukh predates Salman!"
    }, {
        "pair_id": 77,
        "options": [
            "Camel", "Grass"
        ],
        "correct_option": "Camel",
        "description": "Camels, members of the Camelidae family, first evolved in North America approximately 35 million years ago. These adaptable mammals played important roles in transportation and trade. Grass, a vital component of ecosystems, has been a primary producer for millions of years, forming the basis of many food chains. They first appeared about 20 million years ago!"
    }, {
        "pair_id": 78,
        "options": [
            "Jellyfish", "Spiders"
        ],
        "correct_option": "Jellyfish",
        "description": "Spiders, arachnids known for their silk-spinning abilities, evolved over 380 million years ago, becoming skilled predators in various habitats. Jellyfish, ancient marine creatures, originated around 500 million years ago, displaying simple yet effective locomotion and defense mechanisms in ocean currents."
    }, {
        "pair_id": 79,
        "options": [
            "Earthworms", "Ants"
        ],
        "correct_option": "Earthworms",
        "description": "Earthworms, essential soil-dwellers, have been on Earth for over 300 million years, contributing to soil health and nutrient cycling. Ants, known for their social behavior, evolved around 100 million years ago, forming complex colonies with various roles."
    }, {
        "pair_id": 80,
        "options": [
            "USA", "Eyeglasses"
        ],
        "correct_option": "Eyeglasses",
        "description": "Eyeglasses, invented in the late 13th century, provided a revolutionary solution for improving vision. The United States of America (USA) emerged as an independent nation in 1776, marking a significant milestone in history."
    },

    {
        "pair_id": 81,
        "options": ["Sewing Machine", "Stethoscope"],
        "correct_option": "Stethoscope",
        "description": "The sewing machine, a significant advancement in textile manufacturing, was invented in the early 19th century. The first practical sewing machine was patented by Barthélemy Thimonnier on July 17, 1830. On the other hand, the stethoscope, a vital medical instrument, was invented by René Laennec in 1816, marking a breakthrough in auscultation."
      },
      {
        "pair_id": 82,
        "options": ["Bicycle", "Barometer"],
        "correct_option": "Barometer",
        "description": "The barometer, an instrument used to measure atmospheric pressure, was invented in the 17th century. Evangelista Torricelli invented the mercury barometer in 1643. The bicycle, a human-powered mode of transportation, was invented in the early 19th century."
      }
]
